In [1]:
import numpy as np
import pandas as pd

In [3]:
my_dict = {
'col1' : [1,2,3,4],
'col2' : [444,555,666,444],
'col3' : 'abc def ghi jkl'.split()
}

In [23]:
df = pd.DataFrame(my_dict)

In [10]:
#Existe um metodo em pandas para obter apenas valores unicos
df['col2'].unique()
#Esse metodo é semelhante ao metodo de numpy, para fazer em numpy poderiamos usar
#np.unique(df.['col2'])
#obteriamos o mesmo resultado

array([444, 555, 666])

In [11]:
#podemos receber o tamanho do array de elementos unicos
df['col2'].nunique()
#esse metodo é semelhante a usar
#len(df.['col2'].unique())

3

In [15]:
#um metodo mais completo é o value_counts. Que mostra uma serie com as informações
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [16]:
def pot_2(x):
    return x**2

In [18]:
#podemos passar uma função qualquer para o dataframe com o metodo abaixo
df['col1'].apply(pot_2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [19]:
#podemos deletar colunas usando o metodo del, padrão em python
del df['col2']

In [20]:
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  jkl

In [21]:
#podemos obter os valores das colunas com 
df.columns

Index(['col1', 'col3'], dtype='object')

In [22]:
#podemos obter os valores do index com 
df.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
#podemos usar o metodo sort_values para ordenar os valores
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  jkl
1     2   555  def
2     3   666  ghi

In [25]:
#podemos obter uma lista dos dataframes cujo valor é igual a nulo com o metodo abaixo
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [28]:
my_dict2 = {
    'A':'bar bar bar foo foo foo'.split(),
    'B':'one one two two one one'.split(),
    'C':'x y x y x y'.split(),
    'D':[1,3,2,5,4,1]
}
df2 = pd.DataFrame(my_dict2)
df2

     A    B  C  D
0  bar  one  x  1
1  bar  one  y  3
2  bar  two  x  2
3  foo  two  y  5
4  foo  one  x  4
5  foo  one  y  1

In [32]:
#podemos reorganizar os valores de um dataframe com a função pivot_table
df2.pivot_table(values = 'D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  1.0  3.0
    two  2.0  NaN
foo one  4.0  1.0
    two  NaN  5.0